config/workspaces/persistence.el
;;; persistence.el --- Workspaces persistence -*- lexical-binding: t; -*-

(require 'cl-lib)
(require 'workspace-data-model)
(require 'workspace-tabs)
(require 'workspace-buffer-membership)
(require 'workspace-layouts)
(require 'tab-bar)

(defvar workspace-state-directory-override nil
  "When non-nil, an absolute directory used for persistence I/O in place
of the per-machine default.  The explicit hermetic knob: a sandbox or a
scripted batch session sets this to redirect every read/write away from
the developer's real state file.  See `workspace--state-directory'.")

(defun workspace--state-directory ()
  "Return the directory where workspace state is persisted.
Resolves in three tiers (see the module commentary):

1. `workspace-state-directory-override', when non-nil.
2. A per-process sandbox under `temporary-file-directory' whenever
   `noninteractive' is set and no override is given — so a batch/test
   run can never write the real per-machine state file (the
   `kill-emacs-hook' flush fires after any `cl-letf' state-dir rebinding
   has unwound).
3. The per-machine default, keyed by `jf/machine-role' (falling back to
   a `default' subdirectory when the role is unset)."
  (cond
   (workspace-state-directory-override
    (file-name-as-directory
     (expand-file-name workspace-state-directory-override)))
   (noninteractive
    (file-name-as-directory
     (expand-file-name (format "workspaces-batch-state-%d" (emacs-pid))
                       temporary-file-directory)))
   (t
    (let ((subdir (if (and (boundp 'jf/machine-role) jf/machine-role)
                      (concat "state/workspaces/" jf/machine-role "/")
                    "state/workspaces/default/")))
      (expand-file-name subdir (or (and (boundp 'jf/emacs-dir) jf/emacs-dir)
                                   user-emacs-directory))))))

(defun workspace--state-file ()
  "Return the absolute path of the persistence file."
  (expand-file-name "workspaces.eld" (workspace--state-directory)))

(defconst workspace--state-version 3
  "Schema version for the workspaces persistence file.
v3 (current): adds the required =:home= filesystem-anchor slot to every
workspace plist.  Inherits v2's per-layout =:saved-state= /
=:working-state= split, per-leaf =workspace-buffer= reincarnation struct,
=:etc= forward-compat alist.  The reader emits an *Messages* notice and
returns nil for any file whose =:version= is not 3 (no migration: v1 and
v2 files are rejected; delete the file to start fresh, design.md §D5).")

(defun workspace--persistence-serialize-workspace (ws)
  "Return WS reduced to its persistable shape.
The persisted-slot whitelist is =(:name :home :recent-layout-group
:buffer-files :layout-groups)=; any runtime-only tag not in that set is
stripped at this boundary.  Currently that is =:broken= (set by the
deserializer on missing-home detection) — an observation about the
*current session* that must be re-derived on next load, never persisted
(register/invariant/broken-tag-runtime-only, design.md §D5)."
  (list :name (workspace--name ws)
        :home (workspace--home ws)
        :recent-layout-group (workspace--recent-group ws)
        :buffer-files (workspace--buffer-files ws)
        :layout-groups (workspace--layout-groups ws)))

(defun workspace--serialize-registry ()
  "Walk `workspace--registry' and produce its on-disk plist form.
Each workspace is reduced to its persistable shape via
`workspace--persistence-serialize-workspace' — runtime-only tags like
=:broken= are stripped at this boundary."
  (let (workspaces)
    (maphash
     (lambda (_name ws)
       (push (workspace--persistence-serialize-workspace ws) workspaces))
     workspace--registry)
    (list :version workspace--state-version
          :workspaces (nreverse workspaces))))

(defun workspace--deserialize-state (state)
  "Read STATE (the form read from disk) into `workspace--registry'.
Returns the list of workspaces that were inserted into the registry.
Does NOT create tabs — startup hydrates the registry only; tabs are
materialized later by the explicit `workspace-restore' command.  Assumes
STATE has already been version-checked by `workspace--read-state'.

Three filtering rules apply per entry (design.md §D5, §D6; cycle-2
architect finding =arch-cycle-20260525-213500-04= for the
absolute-path arm):

- Entries lacking the required =:home= slot are structural corruption
  (the writer should have produced one); emit an *Messages* notice
  naming the entry and skip it.  Sibling entries in the same file are
  still loaded — one bad entry should not tank the whole session.

- Entries whose =:home= is a relative path violate
  =register/invariant/home-required-no-floating-workspaces= (which
  requires =:home= to be an absolute filesystem anchor).  Such
  entries are skipped with a notice naming the offending value; this
  is the deserializer-side enforcement of the absolute-path
  requirement (the constructor =workspace--make= is the other entry
  point, but we cannot rely on it for hand-edited or corrupted
  persistence files).

- Entries whose =:home= directory does not exist on disk are tagged
  via `workspace--mark-broken' before insertion.  The broken tag is
  runtime-only (never serialized; the next load re-derives it from the
  current filesystem state)."
  (clrhash workspace--registry)
  (let ((ws-list (plist-get state :workspaces))
        (restored nil))
    (dolist (ws ws-list)
      (let ((name (workspace--name ws))
            (home (workspace--home ws)))
        (cond
         ((or (null home) (not (stringp home)))
          (message
           "Workspaces: skipping persisted entry %S — missing :home slot"
           name))
         ((not (file-name-absolute-p home))
          (message
           "Workspaces: skipping persisted entry %S — :home %S is not absolute"
           name home))
         (t
          (let* ((broken-p (not (file-directory-p home)))
                 (with-broken (if broken-p
                                  (workspace--mark-broken ws)
                                ws)))
            (when broken-p
              (message
               "Workspaces: workspace %S has missing :home directory %s — tagged broken"
               name home))
            (puthash name with-broken workspace--registry)
            (push with-broken restored))))))
    (nreverse restored)))
