config/workspaces/persistence.org
* Corruption-safe disk I/O

The persistence boundary defends against two distinct data-loss paths
(design.md §D2, proposal "Layer B"):

1. *Never clobber an unreadable file.*  A failed *read* of a
   present-but-corrupt file used to be indistinguishable from "no
   file" — both returned nil — so the very next autosave would
   serialise an empty registry over the corrupt original, destroying
   the user's only copy.  We now distinguish *absent* (nil → fresh
   start, saving permitted) from *present-but-unreadable* (the
   =workspace--unreadable= sentinel → registry stays empty, all writes
   suppressed for the session via =workspace--persistence-blocked=).
   On the unreadable path the corrupt bytes are first renamed aside to
   a =workspaces.eld.corrupt-<ts>= sibling so they are preserved for
   forensics/recovery, never overwritten.

2. *Never write an unreadable file.*  Before any write reaches disk we
   round-trip the form through =read (prin1-to-string FORM)= (the
   write-time readable assert) and abort the write if it cannot be
   read back, leaving the prior good file intact.  With the
   readable-by-construction serializer (=workspace-layouts=) in place
   this assert should never fire; it is the backstop for any
   unreadable value that slips past the translators.  The write itself
   is atomic — a sibling temp file in the same directory, then
   =rename-file= over the target — so a mid-write crash can never
   truncate the live file.

The session block flag is one-way within a session: a failed load
poisons the in-memory registry, so we never auto-clear and resume
writing; the user fixes/removes the file and restarts.

#+begin_src emacs-lisp
(defvar workspace--persistence-blocked nil
  "Non-nil when the startup load found a present-but-unreadable file.
Suppresses all persistence writes for the rest of the session so an
autosave cannot clobber the backed-up corrupt original with an empty
registry.  Set by `workspace--read-state' on a parse error; never
auto-cleared (the in-memory registry after a failed load is
untrustworthy — fix/remove the file and restart).")

(defvar workspace--persistence-blocked-warned nil
  "Non-nil once the suppressed-write warning has been emitted.
Keeps the block warning to one message per session rather than one
per debounce tick.")
#+end_src

The write-time readable assert uses a =prin1=→=read= round-trip rather
than =readablep=.  =readablep= (Emacs 28+) would be cheaper and the
runtime binary here is Emacs 30, but the round-trip is the version-safe
fallback the task/design call for and its cost is negligible against
the debounced, human-paced write cadence; it also catches the exact
failure mode we care about (a =#<…>= token making the printed form
unreadable) by construction.

#+begin_src emacs-lisp
(defun workspace--state-readable-p (form)
  "Return non-nil if FORM round-trips through `prin1' then `read'.
The write-time readable assert: a single live Emacs object renders as
the unreadable =#<…>= syntax and would make the whole on-disk file
unparseable, so we refuse to write any FORM that cannot be read back.
Total over any input (never signals)."
  (let ((print-length nil)
        (print-level nil))
    (condition-case _err
        (progn (read (prin1-to-string form)) t)
      (error nil))))

(defun workspace--write-state (form)
  "Write FORM to the persistence file atomically, or refuse to write.
No-op (with a one-time warning) while `workspace--persistence-blocked'
is set, so an autosave cannot clobber a backed-up corrupt file.

Aborts without touching disk when FORM fails the write-time readable
assert (`workspace--state-readable-p'), leaving any prior good file
intact.

Otherwise writes FORM to a sibling temp file in the state directory and
`rename-file's it over the target, so a crash mid-write can never
truncate the live file.  Creates the parent directory if missing."
  (cond
   (workspace--persistence-blocked
    (unless workspace--persistence-blocked-warned
      (setq workspace--persistence-blocked-warned t)
      (display-warning
       'workspaces
       (format
        "Persistence is suppressed this session: the state file %s could not be read at startup and was backed up. Writes are disabled to protect the backup. Fix or remove the file and restart."
        (workspace--state-file))
       :warning)))
   ((not (workspace--state-readable-p form))
    (display-warning
     'workspaces
     (format
      "Refusing to write workspaces state: the serialized form is not readable back (contains a live/unreadable object). The previous file at %s is left intact. This is a bug in the serializer; please report it."
      (workspace--state-file))
     :error))
   (t
    (let* ((dir (workspace--state-directory))
           (target (workspace--state-file))
           (_ (make-directory dir t))
           (tmp (make-temp-file
                 (expand-file-name "workspaces.eld.tmp-" dir))))
      (with-temp-file tmp
        (let ((print-length nil)
              (print-level nil))
          (prin1 form (current-buffer))))
      (rename-file tmp target t)))))

(defun workspace--read-state ()
  "Read and return the persisted state form.
Three outcomes (design.md §D2):

- File absent → nil (fresh start; saving stays permitted).
- File present and readable: a v3 plist → that plist; any other
  =:version= → nil with a *Messages* notice (recognized \"ignore and
  start fresh\", not corruption — no backup, no block).
- File present but unreadable (a `read'/parse error): the corrupt bytes
  are renamed aside to a =workspaces.eld.corrupt-<ts>= sibling, a loud
  `display-warning' names both paths, `workspace--persistence-blocked'
  is set, and the sentinel symbol =workspace--unreadable= is returned
  (NOT nil) so `workspace--restore' can tell corruption from absence."
  (let ((file (workspace--state-file)))
    (when (file-exists-p file)
      (condition-case err
          (let ((form (with-temp-buffer
                        (insert-file-contents file)
                        (read (current-buffer)))))
            (let ((v (plist-get form :version)))
              (if (eql v workspace--state-version)
                  form
                (message
                 "Workspaces: persistence file at %s is schema :version %S; v%d required — file ignored. Delete the file to start fresh."
                 file v workspace--state-version)
                nil)))
        (error
         (let ((backup (concat file ".corrupt-"
                               (format-time-string "%Y%m%d-%H%M%S"))))
           (ignore-errors (rename-file file backup t))
           (setq workspace--persistence-blocked t)
           (display-warning
            'workspaces
            (format
             "Could not read the workspaces state file %s (%s). It has been backed up to %s and persistence is suppressed for this session to protect it. Fix or remove the backup and restart."
             file (error-message-string err) backup)
            :error)
           'workspace--unreadable))))))
#+end_src

* Debounced save trigger

#+begin_src emacs-lisp
(defcustom workspace-save-idle-delay 2
  "Idle delay (seconds) before the auto-save trigger writes to disk.
Coalesces bursts of context switches into a single disk write."
  :type 'number
  :group 'workspaces)

(defvar workspace--save-timer nil
  "Pending idle timer for debounced disk save.")

(defun workspace--flush-state ()
  "Write the registry to disk now (cancelling any pending debounce)."
  (when workspace--save-timer
    (cancel-timer workspace--save-timer)
    (setq workspace--save-timer nil))
  (workspace--write-state (workspace--serialize-registry)))

(defun workspace-save-state ()
  "Schedule a debounced save of the workspaces registry to disk.
Cancels any pending timer and re-arms it; the actual disk write
happens after `workspace-save-idle-delay' seconds of idle time.

No-op while `workspace--persistence-blocked' is set: the eventual
`workspace--flush-state' → `workspace--write-state' would refuse the
write anyway, so we do not even arm a useless idle timer."
  (interactive)
  (unless workspace--persistence-blocked
    (when workspace--save-timer
      (cancel-timer workspace--save-timer)
      (setq workspace--save-timer nil))
    (setq workspace--save-timer
          (run-with-idle-timer workspace-save-idle-delay nil
                               #'workspace--flush-state))))
#+end_src

* Wire auto-save into the layout autosave path

Each in-memory snapshot schedules a debounced disk save.  The disk
write therefore lags the in-memory update by the debounce window,
which is the intended trade (design.md §D7).

#+begin_src emacs-lisp
(defun workspace--persistence-after-autosave (&rest _args)
  "Schedule a debounced disk save after an autosave snapshot."
  (workspace-save-state))

(advice-add 'workspace--autosave-current-layout :after
            #'workspace--persistence-after-autosave)
#+end_src

