config/workspaces/persistence.org
* Restore on startup

Registry hydration is synchronous (so the user can call
=workspace-restore= / =workspace-switch= immediately).  Startup creates
NO tabs: restored workspaces are saved-but-not-materialized and only
become live tabs via the explicit =workspace-restore= command.

#+begin_src emacs-lisp
(defun workspace--apply-saved-layout (name)
  "Apply NAME's recent effective window-state to the current frame.
No-op when no saved layout exists.

The effective state is `workspace--layout-effective-state', which
prefers =:working-state= when non-nil, else =:saved-state= (register/
invariant/restore-precedence-working-over-saved).  Direct reads of
either slot from this code path would silently regress the precedence
on a future refactor.

The leaf walker in `workspace--restore-frameset' reincarnates each
saved buffer via the four-step fallback chain (bookmark → filename
→ name → error buffer), so no separate pre-load of file buffers is
needed; the legacy `:buffer-files' slot is left untouched (design.md
§D7).

The restore generation counter (race guard against concurrent
restores; design.md §D2 Gotcha 3) is incremented inside
`workspace--restore-frameset' itself — every restore entry path
participates in the guard, including direct callers like
`workspace-switch-layout'."
  (let ((ws (gethash name workspace--registry)))
    (when ws
      (let* ((recent (workspace--recent-group ws))
             (group (and recent (workspace--find-group ws recent)))
             (layout (and group (workspace--group-recent-layout group)))
             (state (and layout (workspace--layout-effective-state layout))))
        (when state
          (condition-case err
              (workspace--restore-frameset state)
            (error (message "Workspaces: layout restore failed: %s"
                            (error-message-string err)))))))))
#+end_src

* kill-emacs-hook (synchronous flush)

Before flushing the registry, capture the current workspace's
=:working-state= so the in-memory drift since the last autosave/
explicit-save reaches disk.  The capture targets =:working-state= only
(never =:saved-state=) per register/invariant/autosave-never-writes-
saved-state.

The working-state capture is gated on =workspace-anti-save-predicates=
(register/boundary/autosave-guard-pipeline stage 1): if any predicate
returns non-nil, the autosave is silently skipped, but the on-disk
flush of the registry still runs.  Suppressing the capture but NOT
the flush is deliberate — kill-emacs is the last chance to write any
in-memory updates that arrived via other paths (explicit save,
workspace-revert) to disk before shutdown.

#+begin_src emacs-lisp
(defun workspace--kill-emacs-flush ()
  "Capture working-state then write the registry to disk synchronously.
Cancels any pending debounce.  The working-state capture is wrapped in
`ignore-errors' so a capture failure (e.g. unusual frame state during
shutdown) does not prevent the flush itself.

Consults `workspace-anti-save-predicates' before the working-state
capture; the registry flush itself is unconditional (the user has
explicitly initiated shutdown).

Short-circuits entirely when `workspace--persistence-blocked' is set:
the startup load found a corrupt file (now backed up) and the in-memory
registry is untrustworthy, so shutdown must NOT write over the backup.
The `workspace--write-state' choke point would refuse the write anyway;
the explicit early-return avoids the wasted working-state capture and
documents the boundary at the shutdown path itself."
  (unless workspace--persistence-blocked
    (when workspace--save-timer
      (cancel-timer workspace--save-timer)
      (setq workspace--save-timer nil))
    (unless (run-hook-with-args-until-success 'workspace-anti-save-predicates)
      (ignore-errors (workspace--autosave-current-layout :working-state)))
    (ignore-errors (workspace--write-state (workspace--serialize-registry)))))

(add-hook 'kill-emacs-hook #'workspace--kill-emacs-flush)
#+end_src

* Tab-switch advice: autosave outgoing workspace's working-state

When the user navigates away from a workspace tab, snapshot its window
state into =:working-state= so subsequent restores (including restart)
land on the rearrangement, not the last explicit save.  Two
:before-advice attachments — one each on =tab-bar-select-tab= and
=tab-bar-switch-to-tab= — fire before the outgoing tab loses focus,
so =(selected-frame)='s windows still reflect the workspace being left.

The advice is a no-op when the outgoing tab is not a workspace tab
(checked via =workspace--current-name=).  This is the safety guard for
side-by-side development with =activities-tabs-mode= and for ordinary
non-workspace tabs.

The advice writes ONLY to =:working-state=; no syntactic path exists
from this code to =:saved-state= (register/invariant/autosave-never-
writes-saved-state).  The autosave is gated on
=workspace-anti-save-predicates= (register/boundary/autosave-guard-
pipeline stage 1): if any predicate returns non-nil (e.g. the
minibuffer is active or a =*Backtrace*= window is visible), the
snapshot is silently skipped.  This is the wrap-the-caller
attachment-point pinned by cycle-1 on-touch Finding 6 — placing the
guard here rather than inside =workspace--autosave-current-layout=
preserves the structural bypass of the predicates for
=workspace-save= (register/invariant/explicit-save-bypasses-anti-
save), which enters the pipeline at stage 2 directly.

History: v1 introduced the same advice writing to the single
=:frameset= slot, which clobbered explicit saves on every tab close
(archived task =fix-restoration-roundtrip=, bug 4).  v2's two-state
shape makes the clobber structurally impossible.

#+begin_src emacs-lisp
(defun workspace--persistence-before-tab-switch (&rest _args)
  "Snapshot the outgoing workspace's :working-state before the tab switch.
No-op when the current tab is not a workspace-managed tab.  Consults
`workspace-anti-save-predicates'; if any predicate returns non-nil,
the autosave is silently skipped."
  (when (workspace--current-name)
    (unless (run-hook-with-args-until-success 'workspace-anti-save-predicates)
      (workspace--autosave-current-layout :working-state))))

(advice-add 'tab-bar-select-tab :before
            #'workspace--persistence-before-tab-switch)
(advice-add 'tab-bar-switch-to-tab :before
            #'workspace--persistence-before-tab-switch)
#+end_src

* Startup restore entry point

Called from the parent =workspaces.org= after all submodules have
loaded.  Non-fatal on missing/unreadable file (design.md spec
"Missing persistence file is non-fatal").

#+begin_src emacs-lisp
(defun workspace--restore ()
  "Read the persistence file and hydrate the registry only (no tabs).
Restored workspaces are saved-but-not-materialized: reachable via
`workspace-restore' but with no live tab until the user restores one.
Safe to call at startup.

Distinguishes the three `workspace--read-state' outcomes (design.md §D2):

- nil (file absent) → no-op; the registry stays empty and persistence
  is NOT blocked, so a fresh-start save works normally.
- the `workspace--unreadable' sentinel (present-but-corrupt file) →
  no-op; the registry stays empty and `workspace--read-state' has
  already backed the corrupt file up and set
  `workspace--persistence-blocked'.  The sentinel is NOT deserialized.
- a real state plist → deserialize into the registry as usual."
  (let ((state (workspace--read-state)))
    (when (and state (not (eq state 'workspace--unreadable)))
      (workspace--deserialize-state state))))
#+end_src

