config/workspaces/persistence.org
* Explicit save / restore commands

=workspace-save= is the user-facing capture-and-persist command:
it snapshots the current frame into the current workspace's recent
layout group, then flushes the registry to disk synchronously
(no debounce, since this is explicit user intent).

=workspace-restore= materializes a saved workspace into a tab.  Its
candidate list is the full registry — including workspaces with no
live tab — so it complements =workspace-switch= (which is scoped to
live tabs).  When the chosen workspace already has a tab, it switches
to it; otherwise it creates a tab and applies the saved layout.

#+begin_src emacs-lisp
(defun workspace-save ()
  "Save the current workspace's window configuration to disk.
Captures the current frame into the recent layout-group's `:saved-state'
slot, clears any `:working-state' drift on the same layout (the
explicit save is the new clean baseline; register/invariant/explicit-
save-clears-working-state), syncs the workspace's `:buffer-files' from
bufferlo, and writes the registry to disk synchronously.  Errors when
not on a workspaces-managed tab.

The bufferlo sync is intentionally limited to this explicit save path
(and not done by the tab-switch autosave) so that transient session
events — killing a buffer, closing a tab — never wipe the workspace's
saved file list."
  (interactive)
  (let ((ws-name (workspace--current-name)))
    (unless ws-name
      (user-error "Not on a workspaces-managed tab"))
    (workspace--autosave-current-layout :saved-state)
    ;; Clear any accumulated :working-state drift now that we have a
    ;; new explicit baseline.  Without this, the next restart would
    ;; prefer the stale :working-state over the just-written
    ;; :saved-state and the user's save would feel ignored.
    (let* ((ws (gethash ws-name workspace--registry))
           (group-name (workspace--recent-group ws))
           (group (and group-name (workspace--find-group ws group-name)))
           (layout (and group (workspace--group-recent-layout group))))
      (when layout
        (plist-put layout :working-state nil)))
    (workspace--sync-registry-from-bufferlo ws-name)
    (workspace--flush-state)
    ws-name))

(defun workspace-revert ()
  "Discard the current workspace's :working-state and re-apply :saved-state.
The user-facing affordance for \"throw away the autosave drift and
return to my last explicit save\".

Clears the current workspace's recent layout-group's `:working-state'
slot, flushes the registry to disk, then re-applies the layout via
`workspace--apply-saved-layout' (which now picks `:saved-state' because
`:working-state' is nil; register/invariant/restore-precedence-working-
over-saved).

Errors when not on a workspaces-managed tab."
  (interactive)
  (let ((name (workspace--current-name)))
    (unless name
      (user-error "Not on a workspaces-managed tab"))
    (let* ((ws (gethash name workspace--registry))
           (group-name (workspace--recent-group ws))
           (group (and group-name (workspace--find-group ws group-name)))
           (layout (and group (workspace--group-recent-layout group))))
      (when layout
        (plist-put layout :working-state nil)
        (workspace--flush-state)
        (workspace--apply-saved-layout name))
      name)))

(defvar workspace--restore-history nil
  "Minibuffer history for `workspace-restore'.")

(defun workspace-restore (name)
  "Materialize saved workspace NAME by creating or switching to its tab.

If a tab for NAME already exists, switch to it.  Otherwise create a
tab and materialize the workspace.

When the workspace has a saved layout (its recent layout-group has a
non-nil effective state — `:working-state' if set, else `:saved-state';
register/invariant/restore-precedence-working-over-saved), apply that
layout via `workspace--apply-saved-layout'.

When the workspace has NO saved layout (a recovered/registry-only
workspace whose `:layout-groups' are empty or carry no effective
state), fall back to the home builder instead — the same
`workspace-home-builder' indirection `workspace-new' uses — so the new
tab opens <home>/home.org.  No `window-state-put' is attempted in this
case (design.md §D3).

Interactively, completes over every workspace in the registry —
including saved workspaces that have no live tab.

Signals `user-error' if NAME is in a broken state (its `:home' no
longer exists on disk).  Use `workspace-re-anchor' to point it at a
new path or `workspace-purge' to remove the registry entry."
  (interactive
   (let ((names (workspace--registered-names)))
     (unless names
       (user-error "No saved workspaces"))
     (list (completing-read "Restore workspace: " names
                            nil t nil 'workspace--restore-history))))
  (unless (gethash name workspace--registry)
    (user-error "No saved workspace named %s" name))
  (let ((ws (gethash name workspace--registry)))
    (when (and ws (workspace--broken-p ws))
      (user-error
       "Workspace %s is broken: :home %s no longer exists. Use `workspace-re-anchor' or `workspace-purge'."
       name (workspace--home ws))))
  (if-let ((idx (workspace--tab-index-for name)))
      (tab-bar-select-tab idx)
    (tab-bar-new-tab)
    (tab-bar-rename-tab name)
    ;; Decide whether a saved layout exists using the SAME effective-state
    ;; derivation `workspace--apply-saved-layout' uses, so "has a layout"
    ;; cannot diverge from the restore-precedence invariant.
    (let* ((ws (gethash name workspace--registry))
           (recent (and ws (workspace--recent-group ws)))
           (group (and recent (workspace--find-group ws recent)))
           (layout (and group (workspace--group-recent-layout group)))
           (state (and layout (workspace--layout-effective-state layout))))
      (if state
          (workspace--apply-saved-layout name)
        ;; No saved layout: open <home>/home.org via the home builder,
        ;; mirroring `workspace-new'.  Do NOT window-state-put.
        (when (and (boundp 'workspace-home-builder)
                   (functionp workspace-home-builder))
          (funcall workspace-home-builder name)))))
  name)
#+end_src

* Provide

#+begin_src emacs-lisp
(provide 'workspace-persistence)
;;; persistence.el ends here
#+end_src
